/***********************************************************************************
* Наименование модуля	: Переключатель адреса для шины RS-485
*-----------------------------------------------------------------------------------
* Версия				: 1.0
* Автор					: Тимофеев
* Дата создания			: 23.05.2018
************************************************************************************/

//--- INCLUDES -------------------
#include "AddrSwitch.h"

//--- GLOBAL VARIABLES -----------

//--- FUNCTIONS ------------------

/*******************************************************
Функция		: Инициализация железа
Параметр 1	: нет
Возвр. знач.: нет
********************************************************/
void ADRSW_init(void)
{
	// Перевод выводов для переключателя адреса на вход с подтяжкой к земле
	GPIO_PinConfigure( PORT_ADDR_1, PIN_ADDR_1, GPIO_IN_PULL_UP, GPIO_MODE_INPUT );
	GPIO_PinConfigure( PORT_ADDR_2, PIN_ADDR_2, GPIO_IN_PULL_UP, GPIO_MODE_INPUT );
}

/*******************************************************
Функция		: Получение адреса устройства на шине RS-485
Параметр 1	: нет
Возвр. знач.: нет
********************************************************/
uint8_t ADRSW_GetAdr(void)
{
	uint8_t addr = 1;

	if( GPIO_PinRead( PORT_ADDR_1, PIN_ADDR_1 ) == 0 )
	{
		addr = 2;
	}
	else if( GPIO_PinRead( PORT_ADDR_2, PIN_ADDR_2 ) == 0 )
	{
		addr = 3;
	}
	
	addr += ADDR_SHIFT_VALUE;
	
	return addr;
}

