/***********************************************************************************
* Заголовочный файл : Описание железа
* Проект			: Метеостанция WMR500
* Дата создания		: 10.02.2021
* Автор				: Тимофеев
* Версия ПП			: 01 
************************************************************************************/

#ifndef __BOARD_H
#define __BOARD_H

#include "stm32f10x.h"

/*================================================================
Макросы
==================================================================*/
#define GETBIT(value, bit) 	(((value) & (1<<(bit)))>0 ? 1 : 0)
#define SETBIT(value, bit) 	((value) |= (1<<(bit)))
#define CLRBIT(value, bit) 	((value) &= ~(1<<(bit)))
#define SWAP_W(A)			((((A) & 0xFF00) >> 8)  | (((A) & 0x00FF) << 8)) 
/*================================================================
Описание выходов управления системными светодиодами
==================================================================*/
//-- Порты
#define PORT_LED_R      GPIOC
#define PORT_LED_G      GPIOC
#define PORT_LED_B      GPIOC
//-- ID выводов
#define OUT_LED_R       10
#define OUT_LED_G       11
#define OUT_LED_B       12

//-- Порт I2C
#define PORT_I2C		GPIOB
#define PIN_SCL			6
#define PIN_SDA			7

/*================================================================
Описание аналоговых входов
==================================================================*/
#define SUN_CHANNEL			ADC_Channel_0

/*================================================================
Описание цифровых входов
==================================================================*/
//-- Порты
#define INP_WIND_PORT	GPIOC
#define INP_RAIN_PORT	GPIOC

//-- ID выводов
#define INP_WIND_PIN	14
#define INP_RAIN_PIN	13

// -- EXTI
#define WIND_EXTI		(1<<INP_WIND_PIN)
#define RAIN_EXTI		(1<<INP_RAIN_PIN)

/*================================================================
Описание выхода R/W RS-485 (Modbus slave USART1)
==================================================================*/
//-- Порты
#define PORT_RS485_RW GPIOA
//-- ID выводов
#define OUT_RS485_RW	11

/*================================================================
Описание входов переключателя адреса устройства на шине RS-485
==================================================================*/
//-- Порты
#define PORT_ADDR_1   GPIOB
#define PORT_ADDR_2   GPIOB
//-- ID выводов
#define PIN_ADDR_1   12
#define PIN_ADDR_2   13

/*================================================================
Описание для датчика направления ветра
==================================================================*/
//-- Порты
#define PORT_InfLed_1	GPIOC
#define PORT_InfLed_2	GPIOC
#define PORT_InfLed_3	GPIOC
#define PORT_InfLed_4	GPIOC

#define PORT_InfPhoto	GPIOB

//-- ID выводов
#define PIN_InfLed_1   	0
#define PIN_InfLed_2   	1
#define PIN_InfLed_3   	2
#define PIN_InfLed_4   	3

#define PIN_InfPhoto   	0

#endif
